# -*- coding:utf-8 -*-
'''
这是一个公钥加密，公钥解密的RSA演示程序

公式：公钥加密
A:明文
B:密文

A=B^e2 mod n
B=A^e1 mod n
本题中: 920139713为n,19为e1
'''
import string
strs=string.digits+string.lowercase    #列举a-z数字

f=open("data.txt")
data=f.readlines()
f.close()


plaintext=""

for b in data:    #取出所有密文(b)
	for a in strs:   #取出所有可能的明文(a)
		if ord(a)**19 % 920139713==int(b.strip()):         #ord   将字符串转换为ascii码
			plaintext+=a

print plaintext

'''
案例：

{920139713,19}   #公钥，其中920139713为n   19为e1

704796792        #密文  B
752211152
274704164
18414022
368270835
483295235
263072905
459788476
483295235
459788476
663551792
475206804
459788476
428313374
475206804
459788476
425392137
704796792
458265677
341524652
483295235
534149509
425392137
428313374
425392137
341524652
458265677
263072905
483295235
828509797
341524652
425392137
475206804
428313374
483295235
475206804
459788476
306220148
'''